Revit 2026 API

# ExportLayerTableGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of ExportLayerKey, ExportLayerInfo))
```
```cpp
public:
virtual IEnumerator<KeyValuePair<ExportLayerKey^, ExportLayerInfo^>>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
```

#### Return Value

IEnumeratorKeyValuePairExportLayerKey, ExportLayerInfoAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ExportLayerTable Class

Autodesk.Revit.DB Namespace